/*Реализирайте програма, чрез която да се редактират бинарни файлове.
Програмата приема 1 аргумент от командния ред - името на файла, който ще се редактира.

Програмата може да изпълнява команди, прочетени от стандартния вход. Изпълнението на програмата протича по следния начин:
Отваря се файла, чието име е подадено като аргумент от командния ред. Ако файлът не съществува се създава. Ако файлът съществува - съдържанието му НЕ се трие.
Прочита се команда от стандартния вход. Възможните команди са:

d - (display) - Изпечатва се стойността на всеки байт от файла в шестнадесетична бройна система (подобно на данните в левия панел на ghex).

t - (display text) - Изпечатва се стойността на всеки байт от файла интерпретиран като ASCII символ (подобно на данните в десния панел на ghex).

a <new_byte> - (append) - добавя нов байт със стойност <new_byte> в края на файла. <new_byte> е число в интервала [0, ff] в шестнадесетична бройна система.

c <start_index> <end_index> - (cut) - премахва байтовете, които са с индекси по-големи от <start_index> и по-малки от <end_index>. <start_index> и <end_index> са числа в десетична бройна система.

e <index> <new_byte> - (edit) - замества стойността на байта с индекс <index> с <new_byte>.   <index> е число в десетична бройна система. <new_byte> е число в шестнадесетична бройна система в интервала [0, ff].

Програмата приключва при достигане на края на стандартния вход. Ctrl + D

Направете 2 примерни входни файла за програмата:
Първият входен файл съдържа команди, които да запишат текста “Hello World!” във файл.
Вторият входен файл съдържа команди, които генерират файл, със съдържание, избрано от вас.
*/

#include<stdio.h>
#include<stdlib.h>
#include<string.h>
#include<unistd.h>



int main(int argc, char **argp){
    char c_arr[] = {'d', 't', 'a', 'c', 'e'};
    char s[50];
    printf("Input file name:\n");
    sscanf(*(argp+1), "%s", s);
    if(!access(s, F_OK )){
        FILE *f = fopen(s, "r+");
        if(!f){
            perror("Error opening file!");
            exit(-1);
        }
    }
    FILE *f = fopen(s, "w+");
    if(!f){
        perror("Error opening file!");
        exit(-1);
    }
    char *command[30];
    printf("Input command to edit binary file:\n");
    while(){
        if(c == 'd'){
        }
        else if(c == 't'){

        }
        else if(c == 'a'){

        }
        else if(c == 'c'){

        }
        else if(c == 'e'){

        }
    }


    fclose(f);
    return 0;
}