#include<stdio.h>


int main(int argc, char* argv[]){

    int age = 0;
    float weight = 0;

    printf("Моля въведете вашата възраст!:");
    scanf("%d", &age);
    printf("Моля въведете вашето тегло!:");
    scanf("%f", &weight);

    //Ако е под 18 години, значи е непълнолетен

    if(age < 18){
        printf("Вие сте непълнолетен и не може да дарявате кръв или да гласувате!");
    }
    else if(weight < 100){    //Ако е над 18 год и под 100 кг, може да дава кръв
         printf("Може да кръводарявате кръв!");
    }
    else{
      printf("Вие можете само да гласувате!");          //Ако е над 18 без значение кг, може да гласува
    }
    return 0;
}
