
/*Да се направи програма, която изчислява лицето на околната повърхнина и обемът на цилиндър по дадени радиус на основата r и височина h.

Да се създаде следната функция:
int cylinder(double r, double h, double* V, double* S);
При невалидни параметри (<= 0) функцията връща -1. При валидни параметри, функцията пресмята лицето и обема и ги запазва чрез указателите V и S.

Работата на програмата прочита по следния начин:
От стандартния вход се прочитат радиус и височината на цилиндъра (на един ред, разделени с интервали).
При некоректни данни се извежда съобщение за грешка на стандартния изход за грешки без да се прекратява програмата.
При коректни данни се изпечатват лицето на околната повърхнина и обемът на цилиндъра в стандартния изход.

Тези стъпки се изпълняват докато не се въведат две нули от стандартния вход.
*/


#include<stdio.h>
#define PI 3.14
int cylinder(double r, double h, double* V, double* S) {
    if(r <= 0 || h <= 0) {
        return -1;
    }
    *V = r*r*PI*h;
    *S = 2*r*PI*h;
    return 0;
}
int main() {
    double r, h, V, S;
    scanf("%le %le", &r, &h);
    while(r!=0 || h != 0) {
        if(cylinder(r, h, &V, &S) == -1) {
            printf("Invalid data\n");
        } else {
            printf("AREA: %lf   VOLUME: %lf", V, S);
        }
        scanf("%le %le", &r, &h);
    }
    return 0;

}